depot/app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = $1 LIMIT 1  [["id", 980190964]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-09-24 17:04:24.901171"], ["updated_at", "2014-09-24 17:04:24.901171"]]
INSERT INTO "line_items" ("cart_id", "created_at", "price", "product_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 3], ["created_at", "2014-10-01 18:29:56.366906"], ["price", "36.0"], ["product_id", 980190964], ["updated_at", "2014-10-01 18:29:56.366906"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = 1  [["quantity", 2], ["updated_at", "2014-09-24 19:39:50.324365"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = 77  [["quantity", 1], ["updated_at", "2014-10-14 15:30:01.459028"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 60]]
DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 13]]
---
  def destroy
    cart = @line_item.cart
    qty = @line_item.quantity - 1
    if qty > 0
      @line_item.quantity = qty
      @line_item.save
    else
      @line_item.destroy